
## :x: Apply Failed

[CI link](https://github.com/NaokiYazawa/terraform-team10/actions/runs/5015443434)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.aws_ami.amazon-linux-2: Reading...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-06f2af779336fb35a]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-07a4c28652eeaee29]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01ad894d46bd3cad3]
data.aws_ami.amazon-linux-2: Read complete after 1s [id=ami-0828596b82405edd7]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f79bf345d85e387e]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-07fb9f6b52cdbf8be]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-09bd0c935460fc9fe]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-07f32afd5a236a5c1]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-07f264423ca8c4ba5]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0eead1eb49677fff1]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0f290a9651e263ab5]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-008aaccaa805fbb61]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-01c6cbe9a99f690a3]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a0c14da02e24f0c3]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-06eac2c0b2a468a6e]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d96ed8ffec333ffc]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02c6aff70a47b641a]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-02747a2698ed5030b]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-019473ec8cb149b34]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-008aaccaa805fbb611080289494]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-09f95ae288a50c6fc]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0bc3263f6f05ece6c]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f79bf345d85e387e1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-07f264423ca8c4ba51080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_instance_profile.my_profile will be created
  + resource "aws_iam_instance_profile" "my_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "MyProfile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "MyRole"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.my_role will be created
  + resource "aws_iam_role" "my_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "MyRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.my_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "my_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "MyRole"
    }

  # aws_instance.bastion_server will be created
  + resource "aws_instance" "bastion_server" {
      + ami                                  = "ami-0828596b82405edd7"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "MyProfile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-01c6cbe9a99f690a3"
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "app-team10-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "app-team10-alb"
        }
      + tags_all               = {
          + "Name" = "app-team10-alb"
        }
      + vpc_id                 = "vpc-01ad894d46bd3cad3"
    }

  # aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "Allow SSH inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "bastion"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "app-team10-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "app-team10-ecs"
        }
      + tags_all               = {
          + "Name" = "app-team10-ecs"
        }
      + vpc_id                 = "vpc-01ad894d46bd3cad3"
    }

  # aws_security_group.mysql_sg will be created
  + resource "aws_security_group" "mysql_sg" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic from the bastion server to MySQL"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "mysql_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 9000 from Security Group for ALB."
      + from_port                = 9000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9000
      + type                     = "ingress"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
aws_security_group.alb: Creating...
aws_security_group.bastion: Creating...
aws_iam_role.my_role: Creating...
aws_security_group.ecs: Creating...
aws_iam_role.my_role: Creation complete after 1s [id=MyRole]
aws_iam_role_policy_attachment.my_policy_attachment: Creating...
aws_iam_instance_profile.my_profile: Creating...
aws_iam_role_policy_attachment.my_policy_attachment: Creation complete after 0s [id=MyRole-20230518151637683900000001]
aws_iam_instance_profile.my_profile: Creation complete after 0s [id=MyProfile]
aws_security_group.ecs: Creation complete after 4s [id=sg-041bcb6d7a94c6c7b]
aws_security_group.alb: Creation complete after 5s [id=sg-0af7896bb044eb7e0]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group.bastion: Creation complete after 5s [id=sg-0dad0456213a082a7]
aws_security_group.mysql_sg: Creating...
aws_instance.bastion_server: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-3075222001]
aws_security_group.mysql_sg: Creation complete after 3s [id=sg-075302cd488f6a83b]
╷
│ Error: creating EC2 Instance: InvalidParameter: Security group sg-0dad0456213a082a7 and subnet subnet-01c6cbe9a99f690a3 belong to different networks.
│ 	status code: 400, request id: e29b42a2-e72a-4a5b-8623-92b88bac7ca6
│ 
│   with aws_instance.bastion_server,
│   on instance.tf line 11, in resource "aws_instance" "bastion_server":
│   11: resource "aws_instance" "bastion_server" {
│ 
╵
Releasing state lock. This may take a few moments...

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"cbc54bceaa33d00be3422e7a58861d562630c4de","Vars":{},"WorkflowName":"Terraform"} -->